== 20130516_124602 ==

=== gdb howto ===

 <pre>
(gdb) info b

(gdb) info th
  Id   Target Id         Frame 
  5    Thread 0x7fffeffff700 (LWP 10687) "bsc.blktrace" 0x00007ffff78e6303 in __GI___poll (fds=<optimized out>, nfds=<optimized out>, timeout=<optimized out>)
    at ../sysdeps/unix/sysv/linux/poll.c:87
* 4    Thread 0x7ffff5fe7700 (LWP 10686) "bsc.blktrace" handle_pfds_file (tp=0x60c430, nevs=-1, force_read=0) at bsc.blktrace.c:1655
  3    Thread 0x7ffff67e8700 (LWP 10685) "bsc.blktrace" handle_pfds_file (tp=0x60c2d0, nevs=1, force_read=0) at bsc.blktrace.c:1655
  2    Thread 0x7ffff6fe9700 (LWP 10684) "bsc.blktrace" 0x00007ffff78e6303 in __GI___poll (fds=<optimized out>, nfds=<optimized out>, timeout=<optimized out>)
    at ../sysdeps/unix/sysv/linux/poll.c:87
  1    Thread 0x7ffff7ff7700 (LWP 10681) "bsc.blktrace" pthread_cond_timedwait@@GLIBC_2.3.2 () at ../nptl/sysdeps/unix/sysv/linux/x86_64/pthread_cond_timedwait.S:215

(gdb) f
#0  handle_pfds_file (tp=0x60c430, nevs=-1, force_read=0) at bsc.blktrace.c:1655
1655		int i, ret, nentries = 0;

(gdb) bt
#0  handle_pfds_file (tp=0x60c430, nevs=-1, force_read=0) at bsc.blktrace.c:1655
#1  0x00000000004053c1 in thread_main (arg=0x60c430) at bsc.blktrace.c:1794
#2  0x00007ffff7bc4e9a in start_thread (arg=0x7ffff5fe7700) at pthread_create.c:308
#3  0x00007ffff78f1cbd in clone () at ../sysdeps/unix/sysv/linux/x86_64/clone.S:112
#4  0x0000000000000000 in ?? ()

(gdb) ptype * tp->ios
type = struct io_info {
    struct devpath *dpp;
    FILE *ofp;
    char *obuf;
    struct cl_conn *nc;
    struct mmap_info mmap_info;
    unsigned int ready;
    long long unsigned int data_queued;
    int ifd;
    int ofd;
    char ifn[4160];
    char ofn[4160];
}

(gdb) list my_mmap
698	static void *my_mmap(void *addr, size_t length, int prot, int flags, int fd,
699			     off_t offset)
700	{
701		void *new;
702	
703		do {
704			new = mmap(addr, length, prot, flags, fd, offset);
705		} while (new == MAP_FAILED && handle_mem_failure(length));
706	
707		return new;
708	}

(gdb) x/8xb & tp->ios->mmap_info->pagesize
0x7fffe4000918:	0x00	0x10	0x00	0x00	0x00	0x00	0x00	0x00
(gdb) x/4xb & tp->ios->mmap_info->pagesize
0x7fffe4000918:	0x00	0x10	0x00	0x00
(gdb) x/2xb & tp->ios->mmap_info->pagesize
0x7fffe4000918:	0x00	0x10
(gdb) x/1xb & tp->ios->mmap_info->pagesize
0x7fffe4000918:	0x00

(gdb) x/1xg & tp->ios->mmap_info->pagesize
0x7fffe4000918:	0x0000000000001000
(gdb) x/1xw & tp->ios->mmap_info->pagesize
0x7fffe4000918:	0x00001000
(gdb) x/1xh & tp->ios->mmap_info->pagesize
0x7fffe4000918:	0x1000
(gdb) x/1xb & tp->ios->mmap_info->pagesize
0x7fffe4000918:	0x00

(gdb) x/1dg & tp->ios->mmap_info->pagesize
0x7fffe4000918:	4096
(gdb) x/1dw & tp->ios->mmap_info->pagesize
0x7fffe4000918:	4096
(gdb) x/1dh & tp->ios->mmap_info->pagesize
0x7fffe4000918:	4096
(gdb) x/1db & tp->ios->mmap_info->pagesize
0x7fffe4000918:	0

</pre>
